# Connecting to the database

In [1]:
from db_tools.setup import setup

## Getting a SparkSession

In [2]:
spark = setup()

23/10/21 19:26:58 WARN Utils: Your hostname, luan-Dell-G15-5520 resolves to a loopback address: 127.0.1.1; using 192.168.1.10 instead (on interface wlp0s20f3)
23/10/21 19:26:58 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
23/10/21 19:26:59 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/10/21 19:27:00 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

SparkSession available as "spark"

In [3]:
def show_query(query,SparkSession = spark,n = 20):
    return SparkSession.sql(query).show()

## Example 1: Filtering names from the Database

In [4]:
query1 = """SELECT
            	last_name,
            	first_name
            FROM
            	customer
            WHERE
            	first_name = 'Jamie';"""

In [5]:
show_query(query1)

+---------+----------+
|last_name|first_name|
+---------+----------+
|     Rice|     Jamie|
|    Waugh|     Jamie|
+---------+----------+

## Example 2: Filtering names from the Database with logical operators

In [10]:
query2 = """SELECT
                last_name,
            	first_name
            FROM customer
            WHERE first_name = 'Jamie' AND 
            last_name = 'Rice';"""

In [11]:
show_query(query2)

+---------+----------+
|last_name|first_name|
+---------+----------+
|     Rice|     Jamie|
+---------+----------+

In [12]:
query3 = """SELECT
            	first_name,
            	last_name
            FROM
            	customer
            WHERE
            	last_name = 'Rodriguez' OR 
            	first_name = 'Adam';"""

In [13]:
show_query(query3)

+----------+---------+
|first_name|last_name|
+----------+---------+
|     Laura|Rodriguez|
|      Adam|    Gooch|
+----------+---------+

## Example 3: Filtering names from the Database with the IN operator

In [14]:
query4 = """SELECT
	first_name,
	last_name
FROM
	customer
WHERE 
	first_name IN ('Ann','Anne','Annie');"""

In [17]:
show_query(query4)

+----------+---------+
|first_name|last_name|
+----------+---------+
|       Ann|    Evans|
|      Anne|   Powell|
|     Annie|  Russell|
+----------+---------+

In [18]:
query5 = """SELECT
	first_name,
	last_name
FROM
	customer
WHERE 
	first_name LIKE 'Ann%'"""

In [19]:
show_query(query5)

+----------+---------+
|first_name|last_name|
+----------+---------+
|      Anna|     Hill|
|       Ann|    Evans|
|      Anne|   Powell|
|     Annie|  Russell|
|   Annette|    Olson|
+----------+---------+